//STEP04   JOB (ACCT),'CAP R2',CLASS=A,MSGCLASS=X,MSGLEVEL=(1,1)
//*===================================================================
//* STEP 4: CAP ROUND 2 ALLOTMENT
//*===================================================================
//JOBLIB   DD DSN=USERID.ADMIT.LOADLIB,DISP=SHR
//*
//*-------------------------------------------------------------------
//* STEP010: EXECUTE CAPALLOC FOR ROUND 2
//*-------------------------------------------------------------------
//STEP010  EXEC PGM=CAPALLOC
//MERITIN  DD DSN=USERID.ADMIT.OUTPUT.MERITLST,DISP=SHR
//SEATIN   DD DSN=USERID.ADMIT.OUTPUT.SMATXR1,DISP=SHR
//PREFIN   DD DSN=USERID.ADMIT.DATA.PREFS,DISP=SHR
//PREVALLT DD DSN=USERID.ADMIT.OUTPUT.ALR1SORT,DISP=SHR
//ACCEPTIN DD DSN=USERID.ADMIT.DATA.ACCEPT1,DISP=SHR
//ALLOTOUT DD DSN=USERID.ADMIT.OUTPUT.ALLOTR2,
//            DISP=(NEW,CATLG,DELETE),
//            UNIT=SYSDA,SPACE=(CYL,(5,2),RLSE),
//            DCB=(LRECL=250,RECFM=FB,BLKSIZE=25000)
//SEATOUT  DD DSN=USERID.ADMIT.OUTPUT.SMATXR2,
//            DISP=(NEW,CATLG,DELETE),
//            UNIT=SYSDA,SPACE=(CYL,(1,1),RLSE),
//            DCB=(LRECL=200,RECFM=FB,BLKSIZE=20000)
//UNALLOT  DD DSN=USERID.ADMIT.OUTPUT.UNALTR2,
//            DISP=(NEW,CATLG,DELETE),
//            UNIT=SYSDA,SPACE=(CYL,(2,1),RLSE),
//            DCB=(LRECL=200,RECFM=FB,BLKSIZE=20000)
//RPTFILE  DD DSN=USERID.ADMIT.OUTPUT.CAP2RPT,
//            DISP=(NEW,CATLG,DELETE),
//            UNIT=SYSDA,SPACE=(TRK,(5,1),RLSE),
//            DCB=(LRECL=132,RECFM=FBA,BLKSIZE=13200)
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//*
//*-------------------------------------------------------------------
//* STEP020: SORT ROUND 2 ALLOTMENT BY MERIT RANK
//*-------------------------------------------------------------------
//STEP020  EXEC PGM=SORT,COND=(4,LT)
//SYSOUT   DD SYSOUT=*
//SORTIN   DD DSN=USERID.ADMIT.OUTPUT.ALLOTR2,DISP=SHR
//SORTOUT  DD DSN=USERID.ADMIT.OUTPUT.ALR2SORT,
//            DISP=(NEW,CATLG,DELETE),
//            UNIT=SYSDA,SPACE=(CYL,(5,2),RLSE),
//            DCB=(LRECL=250,RECFM=FB,BLKSIZE=25000)
//SYSIN    DD *
  SORT FIELDS=(7,4,CH,A)
/*
